src/InformationRegisters/кфк_т_ТестовыйРегистрСведений/кфк_т_ТестовыйРегистрСведений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>кфк_т_ТестовыйРегистрСведений</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ТестоваяСсылка</name>
    <type>
      <types>CatalogRef.кфк_т_ТестовыйСправочник</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Булево</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Строка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Число</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>30</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаИВремя</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Идентификатор</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/кфк_т_ТестовыйРегистрСведенийПР/кфк_т_ТестовыйРегистрСведенийПР.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>кфк_т_ТестовыйРегистрСведенийПР</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Значение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/AccumulationRegisters/кфк_т_ТестовыйРегистрНакопления/кфк_т_ТестовыйРегистрНакопления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>кфк_т_ТестовыйРегистрНакопления</name>
  <resources>
    <name>Значение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/CommonModules/кфк_т_ТестовыеДанные/Module.bsl
//@skip-check bsl-legacy-check-static-feature-access-for-unknown-left-part

#Область СлужебныйПрограммныйИнтерфейс

Процедура ИнициализацияДанных() Экспорт
	
	Константы.кфкИспользоватьИнтеграцию.Установить(Истина);
	Константы.кфкИспользоватьПотоковыйРежим.Установить(Истина);
	
	Брокер = Брокер();
	
	Родитель = ПродюсерДЗ();
	ПродюсерСправочника(Брокер, Родитель);
	ПродюсерРегистра(Брокер, Родитель);
	ПродюсерРегистраПР(Брокер, Родитель);
	ПродюсерРегистраРН(Брокер, Родитель);
	
	Родитель = КонсьюмерДЗ();
	КонсьюмерСправочника(Брокер, Родитель);
	КонсьюмерРегистра(Брокер, Родитель);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция Брокер()

	Объект = Справочники.кфкБрокеры.СоздатьЭлемент();
	Объект.Наименование = НСтр("ru = 'Брокер по умолчанию'");
	
	НоваяСтрока = Объект.Узлы.Добавить();
	НоваяСтрока.Использование = Истина;
	НоваяСтрока.Адрес = "localhost:29091";
	НоваяСтрока = Объект.Узлы.Добавить();
	НоваяСтрока.Использование = Истина;
	НоваяСтрока.Адрес = "localhost:29092";
	НоваяСтрока = Объект.Узлы.Добавить();
	НоваяСтрока.Использование = Ложь;
	НоваяСтрока.Адрес = "localhost:29093";
	
	Объект.ОбменДанными.Загрузка = Истина;
	Объект.Записать();
	
	Возврат Объект.Ссылка;
	
КонецФункции

#Область Продюсеры

Функция ПродюсерДЗ()
	
	Объект = Справочники.кфкПродюсеры.СоздатьГруппу();
	Объект.Наименование = НСтр("ru = 'Диспетчер задач'");
	Объект.ПодпотокиОбработки = 2;
	Объект.ПодпотокиТранспорта = 1;
	
	Объект.ОбменДанными.Загрузка = Истина;
	Объект.Записать();
	
	Возврат Объект.Ссылка;
	
КонецФункции

Функция ПродюсерСправочника(Брокер, Родитель)
	
	Объект = Справочники.кфкПродюсеры.СоздатьЭлемент();
	Объект.Родитель = Родитель;
	Объект.Наименование = НСтр("ru = 'Продюсер: ТестовыйСправочник'");
	Объект.Брокер = Брокер;
	
	НоваяСтрока = Объект.ОбъектыМетаданных.Добавить();
	НоваяСтрока.ТипОбъект = "Справочник.кфк_т_ТестовыйСправочник";
	НоваяСтрока.ИмяТопика = "1c.test-catalog";
	НоваяСтрока.ТипСериализации = Перечисления.кфкТипыОбработчиков.ПроизвольныйОбработчик;
	НоваяСтрока.ИмяМетодаСериализации = "Справочники.кфк_т_ТестовыйСправочник.Сериализация";
	НоваяСтрока.ИмяМодуляСериализации = "кфк_т_МенеджерОбменаЧерезУниверсальныйФормат";
	НоваяСтрока.ИмяПОДСериализации = "Справочник_ТестовыйСправочник_Отправка";
	НоваяСтрока.ФорматСериализации = "http://v8.fsk.ru/kfk/test/1.0";
	
	НоваяСтрока = Объект.ПараметрыПродюсера.Добавить();
	НоваяСтрока.Ключ = "message.timeout.ms";
	НоваяСтрока.Значение = "5000";
	
	Объект.ОбменДанными.Загрузка = Истина;
	Объект.Записать();
	
	Возврат Объект.Ссылка;
	
КонецФункции

Функция ПродюсерРегистра(Брокер, Родитель)
	
	Объект = Справочники.кфкПродюсеры.СоздатьЭлемент();
	Объект.Родитель = Родитель;
	Объект.Наименование = НСтр("ru = 'Продюсер: Тестовый РС'");
	Объект.Брокер = Брокер;
	
	НоваяСтрока = Объект.ОбъектыМетаданных.Добавить();
	НоваяСтрока.ТипОбъект = "РегистрСведений.кфк_т_ТестовыйРегистрСведений";
	НоваяСтрока.ИмяТопика = "1c.test-register";
	НоваяСтрока.ТипСериализации = Перечисления.кфкТипыОбработчиков.ПроизвольныйОбработчик;
	НоваяСтрока.ИмяМетодаСериализации = "РегистрыСведений.кфк_т_ТестовыйРегистрСведений.Сериализация";
	НоваяСтрока.ИмяМодуляСериализации = "кфк_т_МенеджерОбменаЧерезУниверсальныйФормат";
	НоваяСтрока.ИмяПОДСериализации = "РегистрСведений_ТестовыйРегистрСведений_Отправка";
	НоваяСтрока.ФорматСериализации = "http://v8.fsk.ru/kfk/test/1.0";
	
	НоваяСтрока = Объект.ПараметрыПродюсера.Добавить();
	НоваяСтрока.Ключ = "message.timeout.ms";
	НоваяСтрока.Значение = "5000";
	
	Объект.ОбменДанными.Загрузка = Истина;
	Объект.Записать();
	
	Возврат Объект.Ссылка;
	
КонецФункции

Функция ПродюсерРегистраПР(Брокер, Родитель)
	
	Объект = Справочники.кфкПродюсеры.СоздатьЭлемент();
	Объект.Родитель = Родитель;
	Объект.Наименование = НСтр("ru = 'Продюсер: Тестовый РС (ПР)'");
	Объект.Брокер = Брокер;
	
	НоваяСтрока = Объект.ОбъектыМетаданных.Добавить();
	НоваяСтрока.ТипОбъект = "РегистрСведений.кфк_т_ТестовыйРегистрСведенийПР";
	НоваяСтрока.ИмяТопика = "1c.test-register-rs";
	НоваяСтрока.ТипСериализации = Перечисления.кфкТипыОбработчиков.ПроизвольныйОбработчик;
	НоваяСтрока.ИмяМетодаСериализации = "РегистрыСведений.кфк_т_ТестовыйРегистрСведенийПР.Сериализация";
	НоваяСтрока.ИмяМодуляСериализации = "кфк_т_МенеджерОбменаЧерезУниверсальныйФормат";
	НоваяСтрока.ИмяПОДСериализации = "РегистрСведений_ТестовыйРегистрСведенийПР_Отправка";
	НоваяСтрока.ФорматСериализации = "http://v8.fsk.ru/kfk/test/1.0";
	
	НоваяСтрока = Объект.ПараметрыПродюсера.Добавить();
	НоваяСтрока.Ключ = "message.timeout.ms";
	НоваяСтрока.Значение = "5000";
	
	Объект.ОбменДанными.Загрузка = Истина;
	Объект.Записать();
	
	Возврат Объект.Ссылка;
	
КонецФункции

Функция ПродюсерРегистраРН(Брокер, Родитель)
	
	Объект = Справочники.кфкПродюсеры.СоздатьЭлемент();
	Объект.Родитель = Родитель;
	Объект.Наименование = НСтр("ru = 'Продюсер: Тестовый РН'");
	Объект.Брокер = Брокер;
	
	НоваяСтрока = Объект.ОбъектыМетаданных.Добавить();
	НоваяСтрока.ТипОбъект = "РегистрНакопления.кфк_т_ТестовыйРегистрНакопления";
	НоваяСтрока.ИмяТопика = "1c.test-accumulation-register";
	НоваяСтрока.ТипСериализации = Перечисления.кфкТипыОбработчиков.ПроизвольныйОбработчик;
	НоваяСтрока.ИмяМетодаСериализации = "РегистрыНакопления.кфк_т_ТестовыйРегистрНакопления.Сериализация";
	НоваяСтрока.ИмяМодуляСериализации = "кфк_т_МенеджерОбменаЧерезУниверсальныйФормат";
	НоваяСтрока.ИмяПОДСериализации = "РегистрНакопления_ТестовыйРН_Отправка";
	НоваяСтрока.ФорматСериализации = "http://v8.fsk.ru/kfk/test/1.0";
	
	НоваяСтрока = Объект.ПараметрыПродюсера.Добавить();
	НоваяСтрока.Ключ = "message.timeout.ms";
	НоваяСтрока.Значение = "5000";
	
	Объект.ОбменДанными.Загрузка = Истина;
	Объект.Записать();
	
	Возврат Объект.Ссылка;
	
КонецФункции

#КонецОбласти

#Область Консьюмеры

Функция КонсьюмерДЗ()
	
	Объект = Справочники.кфкКонсьюмеры.СоздатьГруппу();
	Объект.Наименование = НСтр("ru = 'Диспетчер задач'");
	Объект.ПодпотокиОбработки = 2;
	Объект.ПодпотокиТранспорта = 1;
	
	Объект.ОбменДанными.Загрузка = Истина;
	Объект.Записать();
	
	Возврат Объект.Ссылка;
	
КонецФункции

Функция КонсьюмерСправочника(Брокер, Родитель)
	
	Объект = Справочники.кфкКонсьюмеры.СоздатьЭлемент();
	Объект.Родитель = Родитель;
	Объект.Наименование = НСтр("ru = 'Консьюмер: ТестовыйСправочник'");
	Объект.Брокер = Брокер;
	Объект.Идентификатор = "1c-test";
	Объект.ТаймаутОжидания = 5000;
	
	НоваяСтрока = Объект.Топики.Добавить();
	НоваяСтрока.Топик = "1c.test-catalog";
	НоваяСтрока.ТипДесериализации = Перечисления.кфкТипыОбработчиков.ПроизвольныйОбработчик;
	НоваяСтрока.ИмяМетодаДесериализации = "Справочники.кфк_т_ТестовыйСправочник.Десериализация";
	НоваяСтрока.ИмяМодуляДесериализации = "кфк_т_МенеджерОбменаЧерезУниверсальныйФормат";
	НоваяСтрока.ИмяПОДДесериализации = "testCatalog_Получение";
	НоваяСтрока.ФорматДесериализации = "http://v8.fsk.ru/kfk/test/1.0";
	
	НоваяСтрока = Объект.ПараметрыКонсьюмера.Добавить();
	НоваяСтрока.Ключ = "enable.partition.eof";
	НоваяСтрока.Значение = "false";
	НоваяСтрока = Объект.ПараметрыКонсьюмера.Добавить();
	НоваяСтрока.Ключ = "enable.auto.offset.store";
	НоваяСтрока.Значение = "false";
	НоваяСтрока = Объект.ПараметрыКонсьюмера.Добавить();
	НоваяСтрока.Ключ = "enable.auto.commit";
	НоваяСтрока.Значение = "false";
	НоваяСтрока = Объект.ПараметрыКонсьюмера.Добавить();
	НоваяСтрока.Ключ = "auto.offset.reset";
	НоваяСтрока.Значение = "earliest";
	
	Объект.ОбменДанными.Загрузка = Истина;
	Объект.Записать();
	
	Возврат Объект.Ссылка;
	
КонецФункции

Функция КонсьюмерРегистра(Брокер, Родитель)
	
	Объект = Справочники.кфкКонсьюмеры.СоздатьЭлемент();
	Объект.Родитель = Родитель;
	Объект.Наименование = НСтр("ru = 'Консьюмер: Тестовый РС'");
	Объект.Брокер = Брокер;
	Объект.Идентификатор = "1c-test";
	Объект.ТаймаутОжидания = 5000;
	
	НоваяСтрока = Объект.Топики.Добавить();
	НоваяСтрока.Топик = "1c.test-register";
	НоваяСтрока.ТипДесериализации = Перечисления.кфкТипыОбработчиков.ПроизвольныйОбработчик;
	НоваяСтрока.ИмяМетодаДесериализации = "РегистрыСведений.кфк_т_ТестовыйРегистрСведений.Десериализация";
	НоваяСтрока.ИмяМодуляДесериализации = "кфк_т_МенеджерОбменаЧерезУниверсальныйФормат";
	НоваяСтрока.ИмяПОДДесериализации = "testRegister_Получение";
	НоваяСтрока.ФорматДесериализации = "http://v8.fsk.ru/kfk/test/1.0";
	
	НоваяСтрока = Объект.ПараметрыКонсьюмера.Добавить();
	НоваяСтрока.Ключ = "enable.partition.eof";
	НоваяСтрока.Значение = "false";
	НоваяСтрока = Объект.ПараметрыКонсьюмера.Добавить();
	НоваяСтрока.Ключ = "enable.auto.offset.store";
	НоваяСтрока.Значение = "false";
	НоваяСтрока = Объект.ПараметрыКонсьюмера.Добавить();
	НоваяСтрока.Ключ = "enable.auto.commit";
	НоваяСтрока.Значение = "false";
	НоваяСтрока = Объект.ПараметрыКонсьюмера.Добавить();
	НоваяСтрока.Ключ = "auto.offset.reset";
	НоваяСтрока.Значение = "earliest";
	
	Объект.ОбменДанными.Загрузка = Истина;
	Объект.Записать();
	
	Возврат Объект.Ссылка;
	
КонецФункции

#КонецОбласти

#КонецОбласти
